---
kind: property
id: P:Autodesk.Revit.DB.FailureDefinition.Severity
source: html/1eed6182-c88f-0f00-f5e9-dd7bbe634552.htm
---
# Autodesk.Revit.DB.FailureDefinition.Severity Property

The severity of the failure.

## Syntax (C#)
```csharp
public FailureSeverity Severity { get; }
```